32-javascript-applications/backend/app/controllers/airlines_controller.rb

SELECT "airlines".* FROM "airlines"
---
    def index
        airlines = Airline.all

SELECT "airlines".* FROM "airlines" WHERE "airlines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def airline_tickets
        airline = Airline.find(params[:id])