25-validation/rails-dogs/app/views/feeding_times/show.erb

<ul>
<% @feeding_time.dogs.each do | dog | %>
---
SELECT "dogs".* FROM "dogs" INNER JOIN "dog_feeding_times" ON "dogs"."id" = "dog_feeding_times"."dog_id" WHERE "dog_feeding_times"."feeding_time_id" = ?  [["feeding_time_id", 7]]