44-react-router/airlines/backend/app/controllers/airlines_controller.rb

SELECT "airlines".* FROM "airlines" WHERE "airlines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        airline = Airline.find(params[:id])