44-react-router/airlines/backend/app/controllers/tickets_controller.rb

    def create
        ticket = Ticket.create({
            airline_id: params[:airline_id],
            destination: params[:destination],
            starting_point: params[:starting_point],
            seat_number: params[:seat_number],
            date: params[:date],
            price: params[:price]
        })
---
INSERT INTO "tickets" ("airline_id", "destination", "starting_point", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["airline_id", 1], ["destination", "Houston"], ["starting_point", "Brazil"], ["price", 10.0], ["created_at", "2020-04-24 20:00:04.333430"], ["updated_at", "2020-04-24 20:00:04.333430"]]