r.2-a-rails/app/views/albums/show.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = ?  [["album_id", 1]]
---
<ul>
<% @album.songs.each do | song | %>