25-validation/rails-dogs-custom-form/app/controllers/application_controller.rb

    def check_login
        if(session[:user_id] == nil)
            redirect_to("/users/login")
        else
            @current_user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]