31-rails-api/backend/app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters"
---
    def character_data
        character = Character.all[0]

SELECT "characters".* FROM "characters"
UPDATE "characters" SET "y" = ? WHERE "characters"."id" = ?  [["y", "300px"], ["id", 1]]
---
    def save_character_data
        character = Character.all[0]
        character.update({
            x: params[:x],
            y: params[:y]
        })