24-authentication/rails-dogs/app/controllers/dogs_controller.rb

    def index
        user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def new
        @dog = Dog.new
        @breeds = Breed.all
        @feeding_times = FeedingTime.all
---
SELECT "breeds".* FROM "breeds"
SELECT "feeding_times".* FROM "feeding_times"

    def create
        @dog = Dog.create({
            name: params[:dog][:name],
            img_url: params[:dog][:img_url],
            breed_id: params[:dog][:breed_id],
            feeding_time_ids: params[:dog][:feeding_time_ids]
        })
---
INSERT INTO "dog_feeding_times" ("dog_id", "feeding_time_id") VALUES (?, ?)  [["dog_id", 4], ["feeding_time_id", 7]]
INSERT INTO "dogs" ("name", "img_url", "breed_id") VALUES (?, ?, ?)  [["name", "Cooper"], ["img_url", "https://s3.amazonaws.com/cdn-origin-etr.akc.org/wp-content/uploads/2017/11/12130118/Golden-Retriever-Standing1.jpg"], ["breed_id", 8]]

    def edit
        @dog = Dog.find(params[:id])
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]