r.2-a-rails/app/controllers/songs_controller.rb

SELECT "albums".* FROM "albums"
---
    def new
        # Gets the form
        @song = Song.new()
        @albums = Album.all

INSERT INTO "songs" ("album_id", "name") VALUES (?, ?)  [["album_id", 2], ["name", "Song 2"]]
---
    def create
        # Runs with the form submits
        @song = Song.create({
            name: params[:song][:name],
            album_id: params[:song][:album_id]
        })

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "albums".* FROM "albums"
---
    def edit
        @song = Song.find(params[:id])
        @albums = Album.all

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "songs" SET "name" = ? WHERE "songs"."id" = ?  [["name", "My Funny Valentine!"], ["id", 3]]
---
    def update
        @song = Song.find(params[:id])
        @song.update({
            name: params[:song][:name],
            album_id: params[:song][:album_id]
        })

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 1]]
---
    def destroy
        @song = Song.find(params[:id])
        @song.destroy()