survey-react-native/backend/app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
  def index
    render({ json: Dog.all })

SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "dogs" SET "likes" = ? WHERE "dogs"."id" = ?  [["likes", 1], ["id", 4]]
SELECT "dogs".* FROM "dogs"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = ?  [["user_id", 3]]
---
  def update
    dog = Dog.find(params[:id])

    dog.update({
      likes: params[:likes],
    })

    dog.user.devices.each do |device|