r.2-b-rails/app/controllers/books_controller.rb

    def new
        @book = Book.new
        @genres = Genre.all
        @authors = Author.all
---
SELECT "genres".* FROM "genres"
SELECT "authors".* FROM "authors" WHERE 1=0

    def create
        Book.create({
            name: params[:book][:name],
            genre_id: params[:book][:genre_id],
            author_ids: params[:book][:author_ids]
        })
---
INSERT INTO "books" ("name", "genre_id") VALUES (?, ?)  [["name", "LOTR"], ["genre_id", 6]]

    def destroy
        @book = Book.find(params[:id])
        @book.destroy()
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 12]]

    def edit
        @book = Book.find(params[:id])
        @genres = Genre.all
        @authors = Author.all
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
SELECT "authors".* FROM "authors"

    def update
        @book = Book.find(params[:id])
        @book.update({
            name: params[:book][:name],
            genre_id: params[:book][:genre_id],
            author_ids: params[:book][:author_ids]
        })
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "name" = ? WHERE "books"."id" = ?  [["name", "If I Forget "], ["id", 2]]