25-validation/rails-dogs/app/controllers/breeds_controller.rb

    def show
        @breed = Breed.find(params[:id])
---
SELECT "breeds".* FROM "breeds" WHERE "breeds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]