25-validation/rails-dogs/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "joshua@christetulit.org"], ["LIMIT", 1]]
---
    def handle_login
        user = User.find_by({ username: params[:username] })