r.2-b-rails/app/views/books/show.html.erb

<ul>
<% @book.authors.each do | author | %>
---
SELECT "authors".* FROM "authors" INNER JOIN "contributions" ON "authors"."id" = "contributions"."author_id" WHERE "contributions"."book_id" = ?  [["book_id", 5]]