23-cookies-and-sessions/rails-quest/app/controllers/responses_controller.rb

    def new
        @number_correct = session[:number_correct]
        @message = flash[:message]
        @question = Question.all.sample
---
SELECT  "questions".* FROM "questions" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]

    def create

        if( session[:number_correct] != nil )
            @number_correct = session[:number_correct]
        else
            @number_correct = 0
        end

        response = Response.create({
            question_id: params[:response][:question_id],
            answer_id: params[:response][:answer_id]
        })
---
INSERT INTO "responses" ("question_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 46], ["answer_id", 182], ["created_at", "2019-03-19 23:12:15.986101"], ["updated_at", "2019-03-19 23:12:15.986101"]]