20-rails/rails-dogs/app/controllers/dogs_controller.rb

    def create_dog_forms
        @breeds = Breed.all
        @feeding_times = FeedingTime.all
---
SELECT "breeds".* FROM "breeds"
SELECT "feeding_times".* FROM "feeding_times"

    def create
        @dog = Dog.create({
            name: params[:dog_name],
            img_url: params[:dog_image],
            breed_id: params[:dog_breed_id],
            feeding_time_ids: params[:feeding_time_ids]
        })
---
INSERT INTO "dog_feeding_times" ("dog_id", "feeding_time_id") VALUES (?, ?)  [["dog_id", 4], ["feeding_time_id", 1]]
INSERT INTO "dogs" ("name", "img_url", "breed_id") VALUES (?, ?, ?)  [["name", "Cooper"], ["img_url", "https://s3.amazonaws.com/cdn-origin-etr.akc.org/wp-content/uploads/2017/11/12130118/Golden-Retriever-Standing1.jpg"], ["breed_id", 2]]