r.2-b-rails/app/views/authors/show.html.erb

SELECT "books".* FROM "books" INNER JOIN "contributions" ON "books"."id" = "contributions"."book_id" WHERE "contributions"."author_id" = ?  [["author_id", 11]]
---
<ul>
<% @author.books.each do | book | %>