22-rails-form-helpers/rails-dogs/app/controllers/dogs_controller.rb

SELECT "breeds".* FROM "breeds"
SELECT "feeding_times".* FROM "feeding_times"
---
    def new
        @dog = Dog.new
        @breeds = Breed.all
        @feeding_times = FeedingTime.all

INSERT INTO "dog_feeding_times" ("dog_id", "feeding_time_id") VALUES (?, ?)  [["dog_id", 9], ["feeding_time_id", 10]]
INSERT INTO "dogs" ("name", "img_url", "breed_id") VALUES (?, ?, ?)  [["name", "Cooper"], ["img_url", "https://s3.amazonaws.com/cdn-origin-etr.akc.org/wp-content/uploads/2017/11/12130118/Golden-Retriever-Standing1.jpg"], ["breed_id", 11]]
---
    def create
        @dog = Dog.create({
            name: params[:dog][:name],
            img_url: params[:dog][:img_url],
            breed_id: params[:dog][:breed_id],
            feeding_time_ids: params[:dog][:feeding_time_ids]
        })

SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "breeds".* FROM "breeds"
SELECT "feeding_times".* FROM "feeding_times"
---
    def edit
        @dog = Dog.find(params[:id])
        @breeds = Breed.all
        @feeding_times = FeedingTime.all

SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 6]]
---
    def destroy
        @dog = Dog.find(params[:id])
        @dog.destroy()