22-rails-form-helpers/rails-dogs/app/controllers/feeding_times_controller.rb

    def show
        @feeding_time = FeedingTime.find_by(id: params[:id])
---
SELECT "feeding_times".* FROM "feeding_times" WHERE "feeding_times"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]